[HeatEnd X2AbilityTemplate]
LocFriendlyName="Heat End"
LocLongDescription="All your melee attacks set your target on fire."
LocPromotionPopupText="<Bullet/> Every melee attack you perform lights the target on fire if they survive."